[
  {
    "post_name": "brother-ali-goes-deep-on-his-muslim-faith-for-all-the-beauty-in-this-whole-life",
    "date": "",
    "title": "Brother Ali Goes Deep on His Muslim Faith for ‘All the Beauty in This Whole Life’",
    "content": "After a five-year hiatus since the release of Mourning in America and Dreaming in Color, Minnesota rapper Brother Ali — one of Rhymesayers’ most revered acts — is back with a new collection that stands as a refreshing beacon in the current sea of releases. “I always take a long time,” he tells Exclaim! “I don’t really like to be creative if I don’t feel like I have something that I really want to offer. So when I’m full, then I feel like sharing — and then when I’m not, then I just don’t.\n\n“I was trying to get the heart right,” he explains “get my heart right so that I can really live more freely and live more fully.” His sixth studio album, All The Beauty In This Whole Life (out now) is an amalgamation of that journey — a collection of “experiences.”\n\nThe fact that he describes releasing music as sharing is quite fitting, given the deeply personal nature of his discography. His past albums — his last few especially — seem to have followed a linear story of his life. This piece of him focuses heavily on his spirituality. “It’s just really about that seeking. Seeking the divine presence, seeking meaning, seeking connection, seeking to be our truest self — and give life meaning.”\n\nAs we go along on this journey with him, he gives us insight into his childhood with albinism, the suicide of his father and grandfather and a fresh approach to the conversation of police violence in America in the form of an audio letter to his son. “I’ve always done that. That’s one of the things that I feel good about,” he says when talking about how open he is on records. “There are certain topics that can only be talked about from a really personal perspective to be effective.”\n\nLike many of his past releases, this new album was produced entirely by Ant, the main producer for the critically acclaimed Atmosphere. “It’s everything,” says Brother Ali matter-of-factly. “Especially those personal songs, I just can’t do them with somebody else.” His last album, 2012’s Mourning in America and Dreaming in Color was produced was produced entirely by Jake One, whom he considers a dear friend. “We have love for each other…but I can’t get there [musically] with Jake. It can only be Ant.”\n\nWhat is most admirable is the project’s overall approachability — something many writers have praised him for in the past. Shattering unfounded misinformation, he does a wonderful job showing a loving, peaceful side of the Islamic faith that goes largely ignored by the media. We get to see insight and everyday experiences of an intelligent well-spoken Islamic MC navigating a new world. “I’m not necessarily trying to convert people to Islam or demand that spiritual path look like mine. Different people have different experiences, and it doesn’t mean that somebody else’s search for meaning isn’t valid. Everybody is longing for meaning, and their search for meaning is valid.“",
    "clean_content": "After a five-year hiatus since the release of Mourning in America and Dreaming in Color, Minnesota rapper Brother Ali — one of Rhymesayers’ most revered acts — is back with a new collection that stands as a refreshing beacon in the current sea of releases. “I always take a long time,” he tells Exclaim! “I don’t really like to be creative if I don’t feel like I have something that I really want to offer. So when I’m full, then I feel like sharing — and then when I’m not, then I just don’t.\n\n“I was trying to get the heart right,” he explains “get my heart right so that I can really live more freely and live more fully.” His sixth studio album, All The Beauty In This Whole Life (out now) is an amalgamation of that journey — a collection of “experiences.”\n\nThe fact that he describes releasing music as sharing is quite fitting, given the deeply personal nature of his discography. His past albums — his last few especially — seem to have followed a linear story of his life. This piece of him focuses heavily on his spirituality. “It’s just really about that seeking. Seeking the divine presence, seeking meaning, seeking connection, seeking to be our truest self — and give life meaning.”\n\nAs we go along on this journey with him, he gives us insight into his childhood with albinism, the suicide of his father and grandfather and a fresh approach to the conversation of police violence in America in the form of an audio letter to his son. “I’ve always done that. That’s one of the things that I feel good about,” he says when talking about how open he is on records. “There are certain topics that can only be talked about from a really personal perspective to be effective.”\n\nLike many of his past releases, this new album was produced entirely by Ant, the main producer for the critically acclaimed Atmosphere. “It’s everything,” says Brother Ali matter-of-factly. “Especially those personal songs, I just can’t do them with somebody else.” His last album, 2012’s Mourning in America and Dreaming in Color was produced was produced entirely by Jake One, whom he considers a dear friend. “We have love for each other…but I can’t get there [musically] with Jake. It can only be Ant.”\n\nWhat is most admirable is the project’s overall approachability — something many writers have praised him for in the past. Shattering unfounded misinformation, he does a wonderful job showing a loving, peaceful side of the Islamic faith that goes largely ignored by the media. We get to see insight and everyday experiences of an intelligent well-spoken Islamic MC navigating a new world. “I’m not necessarily trying to convert people to Islam or demand that spiritual path look like mine. Different people have different experiences, and it doesn’t mean that somebody else’s search for meaning isn’t valid. Everybody is longing for meaning, and their search for meaning is valid.“",
    "excerpt": "After a five-year hiatus since the release of Mourning in America and Dreaming in Color, Minnesota rapper Brother Ali — one of Rhymesayers’ most revered acts — is back with a new collection that stands as a refreshing be...",
    "source": "EXCLAIM"
  },
  {
    "post_name": "brooklyn-rapper-skyzoo-talks-in-celebration-of-us-black-panther-excitement-and-his-own-marvel-future",
    "date": "",
    "title": "Brooklyn Rapper Skyzoo Talks ‘In Celebration of Us,’ ‘Black Panther’ Excitement and His Own Marvel Future",
    "content": "Brooklyn rapper Skyzoo is dropping his fourth solo studio album, In Celebration of Us, this week, but with a track record that spans 25 releases (including collaborative efforts, EPs, and mixtapes), the 35-year-old rightfully enjoys veteran MC status amongst the industry’s elite. Being held in this high regard is what makes his confidence about In Celebration Of Us so exciting for his core audience.\n\n“It’s my most layered, most conceptual album to date,” he tells Exclaim! “What I wanted to do with it rang so loud to me. I hit this one specific vision, this one mark, clearer than I ever could have on anything else.”\n\nAs Skyzoo explains, the LP was — as the name suggests — a celebration of the black community. “I just wanted to do something that spoke about everything that’s been going on with us as [black] people; the people who look like me, live like me, move like me, have been through what I’ve been through.”\n\nWorking with a host of talented producers like !llmind, frequent Tyrese collaborator Siege Monstrosity, and (of course) Apollo Brown, Skyzoo traverses his focus from a multitude of angles. “Education, for example, and cultural appropriation were big topics for me,” he says. “Obviously police brutality, classicism, economics and things of that nature.”\n\nAs well, he cites his new son as a significant influence on this new work. “The most important thing a black boy can have is his father,” he says. “With so many things that are going on, looking the way we look and being who we are, I wanted this project to serve as a guidebook — something he could always go back to.\n\nWith such a substantial body of work and only one month into 2018, one can just imagine what else Sky has planned for the year ahead. Some fans have already speculated, based on a late summer meeting with Marvel; however, according to Skyzoo, nothing is set in stone.\n\n“I can’t obviously jump into too much of that. But, when it’s time, it’ll come to light,” he says with a laugh. “But, it was an honour and a privilege to even be up there with them. The same way I grew up on hip-hop, I grew up on Spiderman, X-Men and Luke Cage.\n\n“I remember Luke Cage when they brought him back in them’90s,” he says while sharing his fav issues. “It was a limited run, but I had every one of them. I was all about it because it was a black superhero on the cover.\n\n“I even remember when they introduced him with the Punisher,” he continues. “They put him in an experiment, and [Punisher] was black. He was trying to figure out how to manoeuvre through New York as a black man and Luke Cage was helping him out.” [Editor’s note: this occurred in The Punisher #60-62, 1992.]\n\nWith such a profound love of comics and a relationship with Marvel manifesting in some fashion, he is understandably caught up in the Black Panther mania. “I think it’s long overdue,” he says. “I’m all for it. I love seeing the muscle that they’re putting behind it. I love all of the promo, all of the push. I love that it’s the most pre-sold film in the history of Marvel ever.”\n\nAccording to Sky, the parallels between the comic world and hip-hop are vast. “You have these worlds where the heroes are largely misunderstood and are on the outside looking in. They are outcasts, and they turn into heroes that everyone loves. There’s a strength and a power to them. That’s always been the fabric of hip-hop.”\nIn Celebration Of Us is available February 2 via First Generation Rich / Empire.",
    "clean_content": "Brooklyn rapper Skyzoo is dropping his fourth solo studio album, In Celebration of Us, this week, but with a track record that spans 25 releases (including collaborative efforts, EPs, and mixtapes), the 35-year-old rightfully enjoys veteran MC status amongst the industry’s elite. Being held in this high regard is what makes his confidence about In Celebration Of Us so exciting for his core audience.\n\n“It’s my most layered, most conceptual album to date,” he tells Exclaim! “What I wanted to do with it rang so loud to me. I hit this one specific vision, this one mark, clearer than I ever could have on anything else.”\n\nAs Skyzoo explains, the LP was — as the name suggests — a celebration of the black community. “I just wanted to do something that spoke about everything that’s been going on with us as [black] people; the people who look like me, live like me, move like me, have been through what I’ve been through.”\n\nWorking with a host of talented producers like !llmind, frequent Tyrese collaborator Siege Monstrosity, and (of course) Apollo Brown, Skyzoo traverses his focus from a multitude of angles. “Education, for example, and cultural appropriation were big topics for me,” he says. “Obviously police brutality, classicism, economics and things of that nature.”\n\nAs well, he cites his new son as a significant influence on this new work. “The most important thing a black boy can have is his father,” he says. “With so many things that are going on, looking the way we look and being who we are, I wanted this project to serve as a guidebook — something he could always go back to.\n\nWith such a substantial body of work and only one month into 2018, one can just imagine what else Sky has planned for the year ahead. Some fans have already speculated, based on a late summer meeting with Marvel; however, according to Skyzoo, nothing is set in stone.\n\n“I can’t obviously jump into too much of that. But, when it’s time, it’ll come to light,” he says with a laugh. “But, it was an honour and a privilege to even be up there with them. The same way I grew up on hip-hop, I grew up on Spiderman, X-Men and Luke Cage.\n\n“I remember Luke Cage when they brought him back in them’90s,” he says while sharing his fav issues. “It was a limited run, but I had every one of them. I was all about it because it was a black superhero on the cover.\n\n“I even remember when they introduced him with the Punisher,” he continues. “They put him in an experiment, and [Punisher] was black. He was trying to figure out how to manoeuvre through New York as a black man and Luke Cage was helping him out.” [Editor’s note: this occurred in The Punisher #60-62, 1992.]\n\nWith such a profound love of comics and a relationship with Marvel manifesting in some fashion, he is understandably caught up in the Black Panther mania. “I think it’s long overdue,” he says. “I’m all for it. I love seeing the muscle that they’re putting behind it. I love all of the promo, all of the push. I love that it’s the most pre-sold film in the history of Marvel ever.”\n\nAccording to Sky, the parallels between the comic world and hip-hop are vast. “You have these worlds where the heroes are largely misunderstood and are on the outside looking in. They are outcasts, and they turn into heroes that everyone loves. There’s a strength and a power to them. That’s always been the fabric of hip-hop.”\nIn Celebration Of Us is available February 2 via First Generation Rich / Empire.",
    "excerpt": "Brooklyn rapper Skyzoo is dropping his fourth solo studio album, In Celebration of Us, this week, but with a track record that spans 25 releases (including collaborative efforts, EPs, and mixtapes), the 35-year-old right...",
    "source": "EXCLAIM"
  },
  {
    "post_name": "westside-gunn-supreme-blientele-review",
    "date": "",
    "title": "Westside Gunn - Supreme Blientele Review",
    "content": "How do you break down an album when almost every line is quotable? In many ways, rapper Westside Gunn and his Griselda roster are the most consistent team in modern (true school) hip-hop. Everything they release is quality. From that perspective, saying Westside Gunn’s newest release stands among his best should be a sign that it’s honestly something special.\n\nOfficially titled  Supreme Blientele — but also sporting the names Chris Benoit and GOD is the Greatest — the 18-song offering is a cohesive masterpiece. With a soundscape crafted by usual suspects like Alchemist, Roc Marciano, and of course Deringer, as well as pleasant surprises like the iconic Pete Rock and 9th Wonder, the album is 1995 New York City, black Champion hoodie and Timberland boots in the winter vibes, mashed up with the aura and sensibility of Only Built for Cuban Linx.\nDevoid of skippable fluff, it’s a cinematic ride that traverses some of his team’s trademark elements, like drumless soul loops and collaborations with Benny and Conway. However, some of the other guest features provide some of the album’s more magnetic moments — such as Jadakiss’s bars on “GODS Don’t Bleed,” a solid (cocaine-centric) 16 bars by Busta Rhymes on “Brossface Brippler,” and Detroit native Elzhi on “The Steiners.”",
    "clean_content": "How do you break down an album when almost every line is quotable? In many ways, rapper Westside Gunn and his Griselda roster are the most consistent team in modern (true school) hip-hop. Everything they release is quality. From that perspective, saying Westside Gunn’s newest release stands among his best should be a sign that it’s honestly something special.\n\nOfficially titled  Supreme Blientele — but also sporting the names Chris Benoit and GOD is the Greatest — the 18-song offering is a cohesive masterpiece. With a soundscape crafted by usual suspects like Alchemist, Roc Marciano, and of course Deringer, as well as pleasant surprises like the iconic Pete Rock and 9th Wonder, the album is 1995 New York City, black Champion hoodie and Timberland boots in the winter vibes, mashed up with the aura and sensibility of Only Built for Cuban Linx.\nDevoid of skippable fluff, it’s a cinematic ride that traverses some of his team’s trademark elements, like drumless soul loops and collaborations with Benny and Conway. However, some of the other guest features provide some of the album’s more magnetic moments — such as Jadakiss’s bars on “GODS Don’t Bleed,” a solid (cocaine-centric) 16 bars by Busta Rhymes on “Brossface Brippler,” and Detroit native Elzhi on “The Steiners.”",
    "excerpt": "How do you break down an album when almost every line is quotable? In many ways, rapper Westside Gunn and his Griselda roster are the most consistent team in modern (true school) hip-hop.",
    "source": "EXCLAIM"
  },
  {
    "post_name": "possibly-the-most-refreshing-moment-is-anderson-paak-on-the-undeniable-bop-of-the-9th-wonder-produced-wrestlemania-20",
    "date": "",
    "title": "Possibly the most refreshing moment is Anderson .Paak on the undeniable bop of the 9th Wonder-produced “Wrestlemania 20.”",
    "content": "Westside Gunn’s storytelling game is on point, and with his unique cadence, he provides yet another piece of hip-hop artwork — with a cover that makes the LP feels like limited edition fine art. Even with a massive signing with Shady Records, the Buffalo rapper and his circle continue to refrain from mainstream pandering or lame attempts to replicate the “lit” wave. Instead, they stick to their metaphorical (and maybe literal) guns, to rave results. If this LP isn’t better than Flygod, it’s undeniably on par. Next stop, his major label debut.",
    "clean_content": "Westside Gunn’s storytelling game is on point, and with his unique cadence, he provides yet another piece of hip-hop artwork — with a cover that makes the LP feels like limited edition fine art. Even with a massive signing with Shady Records, the Buffalo rapper and his circle continue to refrain from mainstream pandering or lame attempts to replicate the “lit” wave. Instead, they stick to their metaphorical (and maybe literal) guns, to rave results. If this LP isn’t better than Flygod, it’s undeniably on par. Next stop, his major label debut.",
    "excerpt": "Westside Gunn’s storytelling game is on point, and with his unique cadence, he provides yet another piece of hip-hop artwork — with a cover that makes the LP feels like limited edition fine art.",
    "source": "EXCLAIM"
  },
  {
    "post_name": "westside-gunn-takes-one-last-independent-swing-on-supreme-blientele-before-heading-to-the-big-leagues",
    "date": "",
    "title": "Westside Gunn Takes One Last Independent Swing on ‘Supreme Blientele’ Before Heading to the Big Leagues",
    "content": "When it comes to independent success in contemporary hip-hop, not many teams have been able to win without pandering to mainstream pressure quite like Griselda — the tight label family consisting of Benny the Butcher and brothers Conway the Machine and Westside Gunn. Existing as a boutique brand, with niche and remarkably consistent releases (which have earned them a cult following), they’ve been able to tour, sell out anything they drop and secure themselves a spot on the Shady Records roster.\nThat signing hasn’t changed much for the label’s honcho, Westside Gunn, who has yet to release anything under the iconic Eminem-helmed machine. His latest release, Supreme Blientele, will likely be his last as an entirely independent artist.\n\n“I did this also with no big label, no machine, no dollars were given to me for this, no marketing team, no nothing,” Gunn tells Exclaim! “Every last thing was done by myself. I didn’t have PR leading up to this, you know what I’m saying?”\n\nIt’s this genuinely independent spirit that has both driven — and been a source of frustration — for the Buffalo, NY native. As he explains, getting mainstream support for his team has been like pulling teeth. However, with a project that some are comparing to his debut, Flygod, he’s hoping that all stops here. “It’s like, if you don’t want to give me credit, I’m going to make it to the point where you don’t have no choice but to give me credit now.”\n\nHe is, however, highly cognizant of the sound that dominates the airwaves. “This is 100 percent Grizelda, so I’m proud of it. If this would’ve come out back in the day, it would have got that praise that albums like Only Built 4 Cuban Linx received,” he explains. “But, it’s going to get overlooked as a classic because it was made in 2018. Maybe ten years from now it will get that recognition.”\n\nThough it may not be universally hailed as an instant classic like say Pusha-T’s DAYTONA, fans of the rapper cannot stop gushing about the MC’s pen game. “Just think I’m not even the rapper out the crew,” he reiterates with a laugh. “Conway and Benny are the rappers.” In fact, it wasn’t until his brother Conway was shot in the head that he began to rap, to help keep the label moving. Letting that sink in, Westside Gunn’s backstory is worthy of a book — with the team literally going through it all, from federal time to murders.\n\nFor this reason, he likens their collective rise as an example that one can leave the street life alone and overcome. But he’s also quick to point to the authenticity in his particular brand of street music. “I spit that shit, but I drive a nice car. I live in a nice big house. I wear thousands of dollars in jewellery in real life. I’m the fly guy for real.” Aside from a love of all things flashy, he also has a deep rooted love of wrestling.\n\n“Wrestling is my passion,” he says with a laugh. This shouldn’t be a surprise to any real fan, as his music is as synonymous with the “sport” as Wu-Tang is with Kung Fu. “I love designing. I love collecting art, and I love wrestling to keep me like a kid. It keeps me grounded.”\n\nUltimately, his career, in many ways, is just beginning. “We were the kids from Buffalo that nobody checked. So, we had no inspiration,” he says, reflecting on being the first crew to sign a major label deal from their hometown. “This shit is history.” With Conway’s Shady debut 90 percent complete, and his own about to begin production, he’s quick to reassure fans that it will be the same old Griselda. “My debut will be like [Supreme Blientele], just on steroids. Westside Gunn today is going to be Westside Gunn, even on Shady.”",
    "clean_content": "When it comes to independent success in contemporary hip-hop, not many teams have been able to win without pandering to mainstream pressure quite like Griselda — the tight label family consisting of Benny the Butcher and brothers Conway the Machine and Westside Gunn. Existing as a boutique brand, with niche and remarkably consistent releases (which have earned them a cult following), they’ve been able to tour, sell out anything they drop and secure themselves a spot on the Shady Records roster.\nThat signing hasn’t changed much for the label’s honcho, Westside Gunn, who has yet to release anything under the iconic Eminem-helmed machine. His latest release, Supreme Blientele, will likely be his last as an entirely independent artist.\n\n“I did this also with no big label, no machine, no dollars were given to me for this, no marketing team, no nothing,” Gunn tells Exclaim! “Every last thing was done by myself. I didn’t have PR leading up to this, you know what I’m saying?”\n\nIt’s this genuinely independent spirit that has both driven — and been a source of frustration — for the Buffalo, NY native. As he explains, getting mainstream support for his team has been like pulling teeth. However, with a project that some are comparing to his debut, Flygod, he’s hoping that all stops here. “It’s like, if you don’t want to give me credit, I’m going to make it to the point where you don’t have no choice but to give me credit now.”\n\nHe is, however, highly cognizant of the sound that dominates the airwaves. “This is 100 percent Grizelda, so I’m proud of it. If this would’ve come out back in the day, it would have got that praise that albums like Only Built 4 Cuban Linx received,” he explains. “But, it’s going to get overlooked as a classic because it was made in 2018. Maybe ten years from now it will get that recognition.”\n\nThough it may not be universally hailed as an instant classic like say Pusha-T’s DAYTONA, fans of the rapper cannot stop gushing about the MC’s pen game. “Just think I’m not even the rapper out the crew,” he reiterates with a laugh. “Conway and Benny are the rappers.” In fact, it wasn’t until his brother Conway was shot in the head that he began to rap, to help keep the label moving. Letting that sink in, Westside Gunn’s backstory is worthy of a book — with the team literally going through it all, from federal time to murders.\n\nFor this reason, he likens their collective rise as an example that one can leave the street life alone and overcome. But he’s also quick to point to the authenticity in his particular brand of street music. “I spit that shit, but I drive a nice car. I live in a nice big house. I wear thousands of dollars in jewellery in real life. I’m the fly guy for real.” Aside from a love of all things flashy, he also has a deep rooted love of wrestling.\n\n“Wrestling is my passion,” he says with a laugh. This shouldn’t be a surprise to any real fan, as his music is as synonymous with the “sport” as Wu-Tang is with Kung Fu. “I love designing. I love collecting art, and I love wrestling to keep me like a kid. It keeps me grounded.”\n\nUltimately, his career, in many ways, is just beginning. “We were the kids from Buffalo that nobody checked. So, we had no inspiration,” he says, reflecting on being the first crew to sign a major label deal from their hometown. “This shit is history.” With Conway’s Shady debut 90 percent complete, and his own about to begin production, he’s quick to reassure fans that it will be the same old Griselda. “My debut will be like [Supreme Blientele], just on steroids. Westside Gunn today is going to be Westside Gunn, even on Shady.”",
    "excerpt": "When it comes to independent success in contemporary hip-hop, not many teams have been able to win without pandering to mainstream pressure quite like Griselda — the tight label family consisting of Benny the Butcher and...",
    "source": "EXCLAIM"
  },
  {
    "post_name": "milestones-motivation-an-uplifting-chat-with-producer-illmind",
    "date": "",
    "title": "Milestones & Motivation: An Uplifting Chat With Producer Illmind",
    "content": "When it comes to the world of music production, few are as commercially varied — and as forthcoming with inspiration —as Ramon Ibanga Jr., better known as Illmind. With a catalogue of songs that traverses artists like Grand Agent, Supastition and El Da Sensei, to JAY-Z, Drake and even the Moana soundtrack (he produced “You’re Welcome”), not many producers can lay claim to his steady ascent into the upper echelon of the producer world.\n\n“I had multiple turning points and milestones,” he tells Exclaim!, speaking from a couch in the media room during the 2018 “Battle of the Beatmakers” conference. “The first beat I sold was to an artist who I still hold that high regard today, this rapper from Boston named Akrobatik. He was one of the first guys to not only like my beats, but like them enough to want to do a song to it. And at that time I was super stoked about that.”\nHe describes that first sale as the one that let him know he was on the right path. “If it wasn’t for that, I don’t know if I would be still doing this, you know, because it was like that was what solidified what I thought would be my career for the rest of my life,” he says.\n\nIllmind also counts his work with the seminal group Little Brother, and later G-Unit (at the height of their careers) as milestones.\nShortly before sitting with Exclaim!, he was giving a talk to a room of up-and-coming producers, something he does often. “I’ll be honest with you, it’s fucking fun,” he says bluntly about his desire to help lift up others. “Like that’s honestly my fuel, my fuel is the idea that I get to be in a room with a bunch of like-minded people.\n\n“I wouldn’t even really call them aspiring musicians, you know, up and coming. I mean they are, but to me, we’re all the same, you know — I just so happen to have a couple of years more experience than they have,” he adds with a smile. This sharing of knowledge has been a cornerstone of his day-to-day for the better part of the past eight years. From pioneering the monetization of his drum and sample kits, to his highly motivational podcast, he’s not shy about giving producers (and indirectly, creatives at large) the information they need to succeed.\n\n“It’s just really, really fun to me,” he says as he lays out his various outlets. “I’m having a blast. So there’s no reason for me to not do it. I’m enjoying every minute of it.”\nOne of the more interesting topics that Illmind shared with the conference audience was the idea that the ever-hyped “signature sound” that producers were once told to strive for no longer applies. “People have this fantasy of having a signature sound,” he says pointing to names like the Neptunes and Timbaland as examples of producers who dominated the scene in pre-internet hip-hop. “Because of the internet now, and because people are just so connected to each other — and have much easier access — more producers are producing music. There’s more content. Everything is just kind of blending into each other.\n\n“So to me, a signature sound is what you love to produce and that’s really what it comes down to,” he concludes.\n\nAs the interview wraps, Illmind shares one his most powerful pieces of wisdom for producers looking to turn their passion into a career. “You have to assess your situation and try to be as responsible as possible, but also realize that there is no perfect time to take that leap of faith. If you keep waiting for that ‘perfect time,’ it never happens.\n“Regardless of what situation you’re in, the best time to jump is now,” he says. “I — knock on wood — have been fortunate enough to have taken that leap a long time ago and just bet on myself. I just bet all chips in on myself with no regard for repercussions. There’s this and that, obviously, of course, I’ve suffered repercussions; however, what I lacked, I gained in becoming better at my passion and putting myself one step closer to reaching my dream.”",
    "clean_content": "When it comes to the world of music production, few are as commercially varied — and as forthcoming with inspiration —as Ramon Ibanga Jr., better known as Illmind. With a catalogue of songs that traverses artists like Grand Agent, Supastition and El Da Sensei, to JAY-Z, Drake and even the Moana soundtrack (he produced “You’re Welcome”), not many producers can lay claim to his steady ascent into the upper echelon of the producer world.\n\n“I had multiple turning points and milestones,” he tells Exclaim!, speaking from a couch in the media room during the 2018 “Battle of the Beatmakers” conference. “The first beat I sold was to an artist who I still hold that high regard today, this rapper from Boston named Akrobatik. He was one of the first guys to not only like my beats, but like them enough to want to do a song to it. And at that time I was super stoked about that.”\nHe describes that first sale as the one that let him know he was on the right path. “If it wasn’t for that, I don’t know if I would be still doing this, you know, because it was like that was what solidified what I thought would be my career for the rest of my life,” he says.\n\nIllmind also counts his work with the seminal group Little Brother, and later G-Unit (at the height of their careers) as milestones.\nShortly before sitting with Exclaim!, he was giving a talk to a room of up-and-coming producers, something he does often. “I’ll be honest with you, it’s fucking fun,” he says bluntly about his desire to help lift up others. “Like that’s honestly my fuel, my fuel is the idea that I get to be in a room with a bunch of like-minded people.\n\n“I wouldn’t even really call them aspiring musicians, you know, up and coming. I mean they are, but to me, we’re all the same, you know — I just so happen to have a couple of years more experience than they have,” he adds with a smile. This sharing of knowledge has been a cornerstone of his day-to-day for the better part of the past eight years. From pioneering the monetization of his drum and sample kits, to his highly motivational podcast, he’s not shy about giving producers (and indirectly, creatives at large) the information they need to succeed.\n\n“It’s just really, really fun to me,” he says as he lays out his various outlets. “I’m having a blast. So there’s no reason for me to not do it. I’m enjoying every minute of it.”\nOne of the more interesting topics that Illmind shared with the conference audience was the idea that the ever-hyped “signature sound” that producers were once told to strive for no longer applies. “People have this fantasy of having a signature sound,” he says pointing to names like the Neptunes and Timbaland as examples of producers who dominated the scene in pre-internet hip-hop. “Because of the internet now, and because people are just so connected to each other — and have much easier access — more producers are producing music. There’s more content. Everything is just kind of blending into each other.\n\n“So to me, a signature sound is what you love to produce and that’s really what it comes down to,” he concludes.\n\nAs the interview wraps, Illmind shares one his most powerful pieces of wisdom for producers looking to turn their passion into a career. “You have to assess your situation and try to be as responsible as possible, but also realize that there is no perfect time to take that leap of faith. If you keep waiting for that ‘perfect time,’ it never happens.\n“Regardless of what situation you’re in, the best time to jump is now,” he says. “I — knock on wood — have been fortunate enough to have taken that leap a long time ago and just bet on myself. I just bet all chips in on myself with no regard for repercussions. There’s this and that, obviously, of course, I’ve suffered repercussions; however, what I lacked, I gained in becoming better at my passion and putting myself one step closer to reaching my dream.”",
    "excerpt": "When it comes to the world of music production, few are as commercially varied — and as forthcoming with inspiration —as Ramon Ibanga Jr., better known as Illmind.",
    "source": "EXCLAIM"
  },
  {
    "post_name": "just-blaze-discusses-his-first-beat-new-busta-rhymes-and-the-importance-of-giving-back",
    "date": "",
    "title": "Just Blaze Discusses His First Beat, New Busta Rhymes and the Importance of Giving Back",
    "content": "When it comes to entry into the game, not may producers can claim a body of work as influential and commercially successful as Patterson, NJ native Justin Smith, better known as Just Blaze. For the iconic producer, an internship at the storied Cutting Room studio in New York City led to him landing major placements that spun into a run that snapped the sound of hip-hop at the turn of the century.",
    "clean_content": "When it comes to entry into the game, not may producers can claim a body of work as influential and commercially successful as Patterson, NJ native Justin Smith, better known as Just Blaze. For the iconic producer, an internship at the storied Cutting Room studio in New York City led to him landing major placements that spun into a run that snapped the sound of hip-hop at the turn of the century.",
    "excerpt": "When it comes to entry into the game, not may producers can claim a body of work as influential and commercially successful as Patterson, NJ native Justin Smith, better known as Just Blaze.",
    "source": "EXCLAIM"
  },
  {
    "post_name": "we-did-five-records-and-the-first-record-i-played-ended-up-being-the-first-single-from-that-album",
    "date": "",
    "title": "“We did five records, and the first record I played ended up being the first single from that album.”",
    "content": "The song was “I Like It” from the album The Movement, by Ma$e’s ill-fated group Harlem World, which peaked at #11 on the Billboard Hot 200. “It was pretty good. First time out and I had a gold record within a month.”\nFrom there, Just landed incredibly high-profile placements, like “Girls, Girls, Girls” on JAY-Z’s Blueprint LP, “Oh Boy” on Cam’ron’s Come Home With Me, Joe Budden’s “Pump It Up,” and so (so) much more. The most interesting part was that he did it all without confirming to a signature sound, like many of his peers.\n\n“I had a signature energy,” he notes. “None of my beats sound the same, you know? That’s something I learned from being a DJ, is being able to have great diverse sounds because we’re pulling sources. We’re pulling from everywhere. I’m not really worried about having a signature sound, I’m more so concerned with being consistent.”\nNow, 21 years since his first placement, he revels in the ability to give back, to help foster a new generation of game-changing producers.\n\n“Nothing like this existed when I was younger,” he says, sitting in the media room at the “Battle of the Beatmakers” conference in Toronto. “I’m pretty much self-taught when it comes to the technical side of things. Production wasn’t as well known of an art form back then. I have the chance to give that knowledge to the next generation in a way that previous generations before me couldn’t.\n“If I could be a part of that, you know, it’s great, he adds. “There’s no point in hoarding the knowledge and the experience. You’ve got to pass it down; I’m going to continue to cultivate the culture.”\n\nUltimately, he remains thankful for his longevity. “I’m fortunate that I’ve been doing this now 20 years. A lot of producers are lucky if they get three or four,” he says with a smile. “What keeps me going is the fact that I’m always learning and I’m appreciative of the fact that I can still maintain some kind of relevance.”\nSome listeners may not even have realized that he’s managed to quietly stay busy over the past year. “It’s all part of the wave. The wave comes and goes in cycles. You know, you can be hot for like a year-and-a-half straight. Then go quietly.” Having just completed work on T.I.‘s latest LP, next up for the legendary beatsmith is work on the long- (very long) awaited return of Busta Rhymes. “We’re all waiting on that one,” he says with a laugh.",
    "clean_content": "The song was “I Like It” from the album The Movement, by Ma$e’s ill-fated group Harlem World, which peaked at #11 on the Billboard Hot 200. “It was pretty good. First time out and I had a gold record within a month.”\nFrom there, Just landed incredibly high-profile placements, like “Girls, Girls, Girls” on JAY-Z’s Blueprint LP, “Oh Boy” on Cam’ron’s Come Home With Me, Joe Budden’s “Pump It Up,” and so (so) much more. The most interesting part was that he did it all without confirming to a signature sound, like many of his peers.\n\n“I had a signature energy,” he notes. “None of my beats sound the same, you know? That’s something I learned from being a DJ, is being able to have great diverse sounds because we’re pulling sources. We’re pulling from everywhere. I’m not really worried about having a signature sound, I’m more so concerned with being consistent.”\nNow, 21 years since his first placement, he revels in the ability to give back, to help foster a new generation of game-changing producers.\n\n“Nothing like this existed when I was younger,” he says, sitting in the media room at the “Battle of the Beatmakers” conference in Toronto. “I’m pretty much self-taught when it comes to the technical side of things. Production wasn’t as well known of an art form back then. I have the chance to give that knowledge to the next generation in a way that previous generations before me couldn’t.\n“If I could be a part of that, you know, it’s great, he adds. “There’s no point in hoarding the knowledge and the experience. You’ve got to pass it down; I’m going to continue to cultivate the culture.”\n\nUltimately, he remains thankful for his longevity. “I’m fortunate that I’ve been doing this now 20 years. A lot of producers are lucky if they get three or four,” he says with a smile. “What keeps me going is the fact that I’m always learning and I’m appreciative of the fact that I can still maintain some kind of relevance.”\nSome listeners may not even have realized that he’s managed to quietly stay busy over the past year. “It’s all part of the wave. The wave comes and goes in cycles. You know, you can be hot for like a year-and-a-half straight. Then go quietly.” Having just completed work on T.I.‘s latest LP, next up for the legendary beatsmith is work on the long- (very long) awaited return of Busta Rhymes. “We’re all waiting on that one,” he says with a laugh.",
    "excerpt": "The song was “I Like It” from the album The Movement, by Ma$e’s ill-fated group Harlem World, which peaked at #11 on the Billboard Hot 200. “It was pretty good. First time out and I had a gold record within a month.",
    "source": "EXCLAIM"
  },
  {
    "post_name": "a-tribe-called-quests-20-best-songs-ranked",
    "date": "",
    "title": "A Tribe Called Quest’s 20 Best Songs Ranked",
    "content": "For a wide spectrum of musical movements that fall within the lanes of jazz-infused hip-hop, Afrobeats, and, really, anything you cut from the neo-soul cloth, the origin can be traced back to a singular source: A Tribe Called Quest. The sometimes-foursome consisted of prolific producer and MC Q-Tip, the late Phife Dawg, DJ (and co-producer) Ali Shaheed, and — on occasion — Jarobi. For those who get the reference, A-E-I-O-U and sometimes Y.\n\nTheir catalogue contains at least two albums that many regard as the most critical in hip-hop history, inspiring some of the greatest artists of our time: Kanye West, Pharrell, Scarface, Erykah Badu, Common and Jill Scott, to name a few. Their sophomore LP, The Low End Theory, directly inspired Dr. Dre to craft his 1992 classic The Chronic. Elton John once hailed them as “the seminal hip-hop band of all-time” — a testament to the power of their music.\nThe group released five albums before disbanding in 1998 after releasing The Love Movement. Though disheartening, it wasn’t entirely unexpected; by the time their fourth album, Beats, Rhymes and Life, came out, there had been rumblings of discontent.\nOn-and-off reunions took place over the years, with all the group’s members pursuing solo endeavours in between. They eventually reconnected for real (A-E-I-O-U and Y) to create what would be their final album, 2016’s We Got It from Here… Thank You 4 Your Service, 18 years after disbanding.\n\nSadly, it was a bittersweet reunion, as Phife Dawg passed away in his home on March 22, 2016, due to complications from diabetes — a condition the self-proclaimed “funky diabetic” had been battling for much of his career.\n\nFew groups can boast a musical legacy as timeless as Tribe’s, or a family tree as revered. They’re credited with launching the careers of hip-hop royalty such as Busta Rhymes and the late, legendary producer J Dilla. Ultimately, for those who witnessed their prime, Tribe redefined the potential of the genre; they were a turning point.\nAs we reach the 30th anniversary of what’s arguably the group’s greatest album, Midnight Marauders (which came out on November 9, 1993), we’re counting down the top 20 songs from their discography.\nLong live Phife.\n\n\t20.\t“Can I Kick It?”",
    "clean_content": "For a wide spectrum of musical movements that fall within the lanes of jazz-infused hip-hop, Afrobeats, and, really, anything you cut from the neo-soul cloth, the origin can be traced back to a singular source: A Tribe Called Quest. The sometimes-foursome consisted of prolific producer and MC Q-Tip, the late Phife Dawg, DJ (and co-producer) Ali Shaheed, and — on occasion — Jarobi. For those who get the reference, A-E-I-O-U and sometimes Y.\n\nTheir catalogue contains at least two albums that many regard as the most critical in hip-hop history, inspiring some of the greatest artists of our time: Kanye West, Pharrell, Scarface, Erykah Badu, Common and Jill Scott, to name a few. Their sophomore LP, The Low End Theory, directly inspired Dr. Dre to craft his 1992 classic The Chronic. Elton John once hailed them as “the seminal hip-hop band of all-time” — a testament to the power of their music.\nThe group released five albums before disbanding in 1998 after releasing The Love Movement. Though disheartening, it wasn’t entirely unexpected; by the time their fourth album, Beats, Rhymes and Life, came out, there had been rumblings of discontent.\nOn-and-off reunions took place over the years, with all the group’s members pursuing solo endeavours in between. They eventually reconnected for real (A-E-I-O-U and Y) to create what would be their final album, 2016’s We Got It from Here… Thank You 4 Your Service, 18 years after disbanding.\n\nSadly, it was a bittersweet reunion, as Phife Dawg passed away in his home on March 22, 2016, due to complications from diabetes — a condition the self-proclaimed “funky diabetic” had been battling for much of his career.\n\nFew groups can boast a musical legacy as timeless as Tribe’s, or a family tree as revered. They’re credited with launching the careers of hip-hop royalty such as Busta Rhymes and the late, legendary producer J Dilla. Ultimately, for those who witnessed their prime, Tribe redefined the potential of the genre; they were a turning point.\nAs we reach the 30th anniversary of what’s arguably the group’s greatest album, Midnight Marauders (which came out on November 9, 1993), we’re counting down the top 20 songs from their discography.\nLong live Phife.\n\n\t20.\t“Can I Kick It?”",
    "excerpt": "For a wide spectrum of musical movements that fall within the lanes of jazz-infused hip-hop, Afrobeats, and, really, anything you cut from the neo-soul cloth, the origin can be traced back to a singular source: A Tribe C...",
    "source": "EXCLAIM"
  },
  {
    "post_name": "peoples-instinctive-travels-and-the-paths-of-rhythm-1990",
    "date": "",
    "title": "People’s Instinctive Travels and the Paths of Rhythm (1990)",
    "content": "While it’s not the group’s best song, it’s their staple; most notably, it is the first ATCQ single to feature Phife, as the first two from their debut album — as well as the non-album single “Description of a Fool” — were essentially Tip solo cuts. Aside from Phife making a Simpsons-esque prediction of former New York City mayor David Dinkins’s election into office, the song also remains a harsh lesson in the business of sampling. Prominently borrowing from Lou Reed’s “Walk on the Wild Side’’ for the call-and-response classic, Tribe unfortunately neglected to properly clear the sample. Subsequently, they were forced to give the late singer all the profits earned from the track.\n\t19.\t“Stressed Out” feat. Faith Evans",
    "clean_content": "While it’s not the group’s best song, it’s their staple; most notably, it is the first ATCQ single to feature Phife, as the first two from their debut album — as well as the non-album single “Description of a Fool” — were essentially Tip solo cuts. Aside from Phife making a Simpsons-esque prediction of former New York City mayor David Dinkins’s election into office, the song also remains a harsh lesson in the business of sampling. Prominently borrowing from Lou Reed’s “Walk on the Wild Side’’ for the call-and-response classic, Tribe unfortunately neglected to properly clear the sample. Subsequently, they were forced to give the late singer all the profits earned from the track.\n\t19.\t“Stressed Out” feat. Faith Evans",
    "excerpt": "While it’s not the group’s best song, it’s their staple; most notably, it is the first ATCQ single to feature Phife, as the first two from their debut album — as well as the non-album single “Description of a Fool” — wer...",
    "source": "EXCLAIM"
  },
  {
    "post_name": "beats-rhymes-and-life-1996",
    "date": "",
    "title": "Beats, Rhymes and Life (1996)",
    "content": "The group’s fourth album, Beats, Rhymes and Life, was met with mixed reviews (largely due to the brilliance of the albums that preceded it). “Stressed Out,” though, was a clear high note of the project, with a Bad Boy Entertainment-era Faith Evans helping the crew to strike a street-centric note that cautioned about letting your emotions jam you up in the video game of life. Notably, it’s the sole official single that featured Consequence (who had a lot of mic time on the LP).\n\n\t18.\t“1nce Again” ft. Tammy Lucas",
    "clean_content": "The group’s fourth album, Beats, Rhymes and Life, was met with mixed reviews (largely due to the brilliance of the albums that preceded it). “Stressed Out,” though, was a clear high note of the project, with a Bad Boy Entertainment-era Faith Evans helping the crew to strike a street-centric note that cautioned about letting your emotions jam you up in the video game of life. Notably, it’s the sole official single that featured Consequence (who had a lot of mic time on the LP).\n\n\t18.\t“1nce Again” ft. Tammy Lucas",
    "excerpt": "The group’s fourth album, Beats, Rhymes and Life, was met with mixed reviews (largely due to the brilliance of the albums that preceded it).",
    "source": "EXCLAIM"
  },
  {
    "post_name": "beats-rhymes-and-life-1996",
    "date": "",
    "title": "Beats, Rhymes and Life (1996)",
    "content": "The Gary Burton-sampling “1nce Again,” featuring a smooth chorus by singer Tammy Lucas — daughter of iconic drummer Ray Lucas — was the beginning of a new era for Tribe, defined by the new edge and darker sound of the Ummah (a production group that Tip and Sha built around legendary producer J Dilla). Though the single still holds up, the album was the first time fans could hear the strain in the group, garnering mixed reviews.\n\n\t17.\t“The Space Program”",
    "clean_content": "The Gary Burton-sampling “1nce Again,” featuring a smooth chorus by singer Tammy Lucas — daughter of iconic drummer Ray Lucas — was the beginning of a new era for Tribe, defined by the new edge and darker sound of the Ummah (a production group that Tip and Sha built around legendary producer J Dilla). Though the single still holds up, the album was the first time fans could hear the strain in the group, garnering mixed reviews.\n\n\t17.\t“The Space Program”",
    "excerpt": "The Gary Burton-sampling “1nce Again,” featuring a smooth chorus by singer Tammy Lucas — daughter of iconic drummer Ray Lucas — was the beginning of a new era for Tribe, defined by the new edge and darker sound of the Um...",
    "source": "EXCLAIM"
  },
  {
    "post_name": "we-got-it-from-here-thank-you-4-your-service-2016",
    "date": "",
    "title": "We Got It from Here… Thank You 4 Your Service (2016)",
    "content": "Every die-hard Tribe fan remembers where they were at midnight on November 11, 2016, when they, semi-wearily, opened Spotify to find the final Tribe Called Quest LP, We Got It from Here… Thank You 4 Your Service, available for streaming — 18 years removed from “The Love Movement.” The first song on the LP, “The Space Program” — a self-described “treatise on Black unity” and brilliant commentary on the policies around living space and the dark side of gentrification — feels undeniably like classic Tribe. Released posthumously following Phife’s passing, when the five-foot assassin’s verse finally comes in, it’s hard not to be overwhelmed with emotion.\n\n\t16.\t“I Left My Wallet in El Segundo”",
    "clean_content": "Every die-hard Tribe fan remembers where they were at midnight on November 11, 2016, when they, semi-wearily, opened Spotify to find the final Tribe Called Quest LP, We Got It from Here… Thank You 4 Your Service, available for streaming — 18 years removed from “The Love Movement.” The first song on the LP, “The Space Program” — a self-described “treatise on Black unity” and brilliant commentary on the policies around living space and the dark side of gentrification — feels undeniably like classic Tribe. Released posthumously following Phife’s passing, when the five-foot assassin’s verse finally comes in, it’s hard not to be overwhelmed with emotion.\n\n\t16.\t“I Left My Wallet in El Segundo”",
    "excerpt": "Every die-hard Tribe fan remembers where they were at midnight on November 11, 2016, when they, semi-wearily, opened Spotify to find the final Tribe Called Quest LP, We Got It from Here… Thank You 4 Your Service, availab...",
    "source": "EXCLAIM"
  },
  {
    "post_name": "peoples-instinctive-travels-and-the-paths-of-rhythm-1990",
    "date": "",
    "title": "People’s Instinctive Travels and the Paths of Rhythm (1990)",
    "content": "To truly grasp the brilliance of “I Left My Wallet in El Segundo,” one must understand the hip-hop climate at the time of its release as the first official single off of their debut. In a year that witnessed Ice Cube releasing his solo debut, new jack domination and MC Hammer redefining the genre’s commercial landscape, Tribe came from left field. Sampling the Chambers Brothers, the song follows Tip and his crew as they cruise a bit too far from Brooklyn, leading the rapper to inadvertently leave his wallet in a Mexican cantina. This track is a playful nod to the classic TV show Sanford and Son, where comedian Red Foxx would often reference El Segundo as a stand-in for any distant place. While it might not be a universal favourite, it’s undeniably a critical classic.\n\n\t15.\t“Dis Generation” feat. Busta Rhymes",
    "clean_content": "To truly grasp the brilliance of “I Left My Wallet in El Segundo,” one must understand the hip-hop climate at the time of its release as the first official single off of their debut. In a year that witnessed Ice Cube releasing his solo debut, new jack domination and MC Hammer redefining the genre’s commercial landscape, Tribe came from left field. Sampling the Chambers Brothers, the song follows Tip and his crew as they cruise a bit too far from Brooklyn, leading the rapper to inadvertently leave his wallet in a Mexican cantina. This track is a playful nod to the classic TV show Sanford and Son, where comedian Red Foxx would often reference El Segundo as a stand-in for any distant place. While it might not be a universal favourite, it’s undeniably a critical classic.\n\n\t15.\t“Dis Generation” feat. Busta Rhymes",
    "excerpt": "To truly grasp the brilliance of “I Left My Wallet in El Segundo,” one must understand the hip-hop climate at the time of its release as the first official single off of their debut.",
    "source": "EXCLAIM"
  },
  {
    "post_name": "we-got-it-from-here-thank-you-4-your-service-2016",
    "date": "",
    "title": "We Got It from Here… Thank You 4 Your Service (2016)",
    "content": "There’s something both profoundly beautiful and heart-wrenching about “Dis Generation,” which stands as the final single the group released. Fittingly, the song features the original lineup, including Jarobi as well as Busta Rhymes, the latter of whom was a consistent presence throughout the group’s catalogue. Serving as a heartfelt ode to the new generation of artists who can rightfully consider themselves akin to ATCQ, the song definitively proves that, even 18 years later and through all the ups and downs, the group’s chemistry and youthful zest on the mic remain undiminished; it sounds like pure adulterated love for the art of it all. It doesn’t get more hip-hop than that.\n\n\t14.\t“Excursions”",
    "clean_content": "There’s something both profoundly beautiful and heart-wrenching about “Dis Generation,” which stands as the final single the group released. Fittingly, the song features the original lineup, including Jarobi as well as Busta Rhymes, the latter of whom was a consistent presence throughout the group’s catalogue. Serving as a heartfelt ode to the new generation of artists who can rightfully consider themselves akin to ATCQ, the song definitively proves that, even 18 years later and through all the ups and downs, the group’s chemistry and youthful zest on the mic remain undiminished; it sounds like pure adulterated love for the art of it all. It doesn’t get more hip-hop than that.\n\n\t14.\t“Excursions”",
    "excerpt": "There’s something both profoundly beautiful and heart-wrenching about “Dis Generation,” which stands as the final single the group released.",
    "source": "EXCLAIM"
  },
  {
    "post_name": "the-low-end-theory-1991",
    "date": "",
    "title": "The Low End Theory (1991)",
    "content": "Over a plucky bassline borrowed from Art Blakey and the Jazz Messengers, Tip goes solo, setting the tone not only for the group’s sophomore effort but also for the iteration of ATCQ that would come to define the remainder of their run. From alluding to his Islamic faith (“Stick out the left, then I’ll ask for the other hand”) to subtly warning about the dangers of studio posturing (“Don’t be phoney and expect one not to flex”), the song stood the test of time as the group’s unbroken mission statement: to make moves, never fake moves, or fall prey to a hip-hop crime.\n\n13: “If The Papes Come” feat. Baby Bam",
    "clean_content": "Over a plucky bassline borrowed from Art Blakey and the Jazz Messengers, Tip goes solo, setting the tone not only for the group’s sophomore effort but also for the iteration of ATCQ that would come to define the remainder of their run. From alluding to his Islamic faith (“Stick out the left, then I’ll ask for the other hand”) to subtly warning about the dangers of studio posturing (“Don’t be phoney and expect one not to flex”), the song stood the test of time as the group’s unbroken mission statement: to make moves, never fake moves, or fall prey to a hip-hop crime.\n\n13: “If The Papes Come” feat. Baby Bam",
    "excerpt": "Over a plucky bassline borrowed from Art Blakey and the Jazz Messengers, Tip goes solo, setting the tone not only for the group’s sophomore effort but also for the iteration of ATCQ that would come to define the remainde...",
    "source": "EXCLAIM"
  },
  {
    "post_name": "can-i-kick-it-1990",
    "date": "",
    "title": "“Can I Kick It?” (1990)",
    "content": "Featuring Jungle Brother member Baby Bam, this moody, jazz-tinged, Lou Donaldson-sampling gem didn’t make the cut on the group’s debut album, though it was included as the B-Side of “Can I Kick It?” What makes it so great is how well it bridges the first and second albums, foreshadowing the darker jazzy vibes to come. It remained a bit of an IYKYK gem until getting a later shine on Tribe comps, notably the must-own The Anthology — albeit without Bam’s verse. In hindsight, a Phife verse would have been incredible.\n\n\t12.\t“Scenario” feat. Leaders of the New School",
    "clean_content": "Featuring Jungle Brother member Baby Bam, this moody, jazz-tinged, Lou Donaldson-sampling gem didn’t make the cut on the group’s debut album, though it was included as the B-Side of “Can I Kick It?” What makes it so great is how well it bridges the first and second albums, foreshadowing the darker jazzy vibes to come. It remained a bit of an IYKYK gem until getting a later shine on Tribe comps, notably the must-own The Anthology — albeit without Bam’s verse. In hindsight, a Phife verse would have been incredible.\n\n\t12.\t“Scenario” feat. Leaders of the New School",
    "excerpt": "Featuring Jungle Brother member Baby Bam, this moody, jazz-tinged, Lou Donaldson-sampling gem didn’t make the cut on the group’s debut album, though it was included as the B-Side of “Can I Kick It?” What makes it so grea...",
    "source": "EXCLAIM"
  },
  {
    "post_name": "the-low-end-theory-1991",
    "date": "",
    "title": "The Low End Theory (1991)",
    "content": "The original and its remix are a clear tie. Few songs in hip-hop history have catapulted a career as effectively as “Scenario” did. While the track marked a significant moment for Leaders of the New School, it was even more notable as the catalyst for Busta Rhymes’ emergence as a breakout star. Although Leaders of the New School released two albums, Busta’s undeniable charisma eventually led to tensions within the group. He continued to collaborate closely with Tribe, even making an appearance on Midnight Marauders before embarking on a successful solo career in 1996. The song’s remix, equally as amazing, was also set to be a significant moment for rapper Kid Hood. Tragically, he was killed just three days after recording his verse.\n\n\t11.\t“Jazz (We’ve Got)”",
    "clean_content": "The original and its remix are a clear tie. Few songs in hip-hop history have catapulted a career as effectively as “Scenario” did. While the track marked a significant moment for Leaders of the New School, it was even more notable as the catalyst for Busta Rhymes’ emergence as a breakout star. Although Leaders of the New School released two albums, Busta’s undeniable charisma eventually led to tensions within the group. He continued to collaborate closely with Tribe, even making an appearance on Midnight Marauders before embarking on a successful solo career in 1996. The song’s remix, equally as amazing, was also set to be a significant moment for rapper Kid Hood. Tragically, he was killed just three days after recording his verse.\n\n\t11.\t“Jazz (We’ve Got)”",
    "excerpt": "The original and its remix are a clear tie. Few songs in hip-hop history have catapulted a career as effectively as “Scenario” did.",
    "source": "EXCLAIM"
  },
  {
    "post_name": "the-low-end-theory-1991",
    "date": "",
    "title": "The Low End Theory (1991)",
    "content": "Aside from serving as an easy entry point into the group’s mastery of jazz-infused hip-hop, “Jazz (We’ve Got)” was also what started a short-lived beef between the group and the Teddy Riley-produced outfit Wreckx-n-Effect. In particular, the group took offence to the bar “Me sweat another? I do my own thing / Strictly hardcore tracks, not a new jack swing.” While Phife was referencing the genre generally, the group thought he was pointing to their song of the same name. Notably, the song was also originally produced by Pete Rock before being reinterpreted by Q-Tip. Tip directly acknowledged this in the outro, exclaiming, “Pete Rock for the beat ya don’t stop.”\n\n\t10.\t“Hot Sex”",
    "clean_content": "Aside from serving as an easy entry point into the group’s mastery of jazz-infused hip-hop, “Jazz (We’ve Got)” was also what started a short-lived beef between the group and the Teddy Riley-produced outfit Wreckx-n-Effect. In particular, the group took offence to the bar “Me sweat another? I do my own thing / Strictly hardcore tracks, not a new jack swing.” While Phife was referencing the genre generally, the group thought he was pointing to their song of the same name. Notably, the song was also originally produced by Pete Rock before being reinterpreted by Q-Tip. Tip directly acknowledged this in the outro, exclaiming, “Pete Rock for the beat ya don’t stop.”\n\n\t10.\t“Hot Sex”",
    "excerpt": "Aside from serving as an easy entry point into the group’s mastery of jazz-infused hip-hop, “Jazz (We’ve Got)” was also what started a short-lived beef between the group and the Teddy Riley-produced outfit Wreckx-n-Effec...",
    "source": "EXCLAIM"
  },
  {
    "post_name": "boomerang-original-soundtrack-album-1992",
    "date": "",
    "title": "Boomerang: Original Soundtrack Album (1992)",
    "content": "A playful spin on a Lou Donaldson riff — the same riff used four years earlier by Marley Marl for Craig G’s seminal classic “Droppin’ Science” — “Hot Sex” was a significant moment for the group, appearing on the soundtrack for Eddie Murphy’s box office hit Boomerang. It remains one of the higher-energy songs in their discography; not quite as rambunctious as “Scenario,” it’s a tonal shift from the laid-back, jazzy funk of the second golden era that Midnight Marauders ushered in the following year. Interestingly, Tip wore a peculiar mask in the video to hide facial injuries he sustained from a scuffle with the new jack swing group Wreckx-n-Effect.\n\n\t9.\t“Buggin’ Out”",
    "clean_content": "A playful spin on a Lou Donaldson riff — the same riff used four years earlier by Marley Marl for Craig G’s seminal classic “Droppin’ Science” — “Hot Sex” was a significant moment for the group, appearing on the soundtrack for Eddie Murphy’s box office hit Boomerang. It remains one of the higher-energy songs in their discography; not quite as rambunctious as “Scenario,” it’s a tonal shift from the laid-back, jazzy funk of the second golden era that Midnight Marauders ushered in the following year. Interestingly, Tip wore a peculiar mask in the video to hide facial injuries he sustained from a scuffle with the new jack swing group Wreckx-n-Effect.\n\n\t9.\t“Buggin’ Out”",
    "excerpt": "A playful spin on a Lou Donaldson riff — the same riff used four years earlier by Marley Marl for Craig G’s seminal classic “Droppin’ Science” — “Hot Sex” was a significant moment for the group, appearing on the soundtra...",
    "source": "EXCLAIM"
  },
  {
    "post_name": "the-low-end-theory-1991",
    "date": "",
    "title": "The Low End Theory (1991)",
    "content": "A flip of a deliciously obscure Jack DeJohnette sample, “Buggin’ Out” served as the B-side to The Low End Theory’s second single, “Jazz (We’ve Got).” It’s clear that both Tip and Phife had a chip on their shoulder about the new jack swing R&B that was running the landscape of the day. Notably, he spits, “Smokin’ R&B cause they try to do me / Or the best of the pack but they can’t do rap,” before fantasizing about pulling the plug on the genre on a whole.\n\n\t8.\t“Lyrics to Go”\nMidnight Marauders (1993)\n\nThis lyrical standout from Midnight Marauders is made even more spectacular by its mind-melting instrumental. Q-Tip was renowned for experimenting with his production techniques. On “Lyrics to Go,” the abstract one harnesses a very specific portion of Minnie Riperton’s signature whistle register from “Inside My Love,” weaving the note throughout the track.\n\n\t7.\t“Sucka Nigga”\nMidnight Marauders (1993)\n\nA flip of Jack Wilkins’ “Red Clay,” Tip went solo for “Sucka Nigga,” which features one of the deepest, most blissful basslines on Midnight Marauders. His penmanship is exquisite as he delves into the use of the N-word, from its origins in the Deep South to its eventual embedding in the vernacular of everyday Black men. The term has transitioned from a term of endearment to a staple in hip-hop lyrics. The verse is “so phat, it’s reminiscent of a whale” — so captivating, in fact, that you hardly notice he delivers it twice in a row.\n\n\t6.\t“Find a Way”",
    "clean_content": "A flip of a deliciously obscure Jack DeJohnette sample, “Buggin’ Out” served as the B-side to The Low End Theory’s second single, “Jazz (We’ve Got).” It’s clear that both Tip and Phife had a chip on their shoulder about the new jack swing R&B that was running the landscape of the day. Notably, he spits, “Smokin’ R&B cause they try to do me / Or the best of the pack but they can’t do rap,” before fantasizing about pulling the plug on the genre on a whole.\n\n\t8.\t“Lyrics to Go”\nMidnight Marauders (1993)\n\nThis lyrical standout from Midnight Marauders is made even more spectacular by its mind-melting instrumental. Q-Tip was renowned for experimenting with his production techniques. On “Lyrics to Go,” the abstract one harnesses a very specific portion of Minnie Riperton’s signature whistle register from “Inside My Love,” weaving the note throughout the track.\n\n\t7.\t“Sucka Nigga”\nMidnight Marauders (1993)\n\nA flip of Jack Wilkins’ “Red Clay,” Tip went solo for “Sucka Nigga,” which features one of the deepest, most blissful basslines on Midnight Marauders. His penmanship is exquisite as he delves into the use of the N-word, from its origins in the Deep South to its eventual embedding in the vernacular of everyday Black men. The term has transitioned from a term of endearment to a staple in hip-hop lyrics. The verse is “so phat, it’s reminiscent of a whale” — so captivating, in fact, that you hardly notice he delivers it twice in a row.\n\n\t6.\t“Find a Way”",
    "excerpt": "A flip of a deliciously obscure Jack DeJohnette sample, “Buggin’ Out” served as the B-side to The Low End Theory’s second single, “Jazz (We’ve Got).",
    "source": "EXCLAIM"
  },
  {
    "post_name": "the-love-movement-1998",
    "date": "",
    "title": "The Love Movement (1998)",
    "content": "“Find a Way” serves as the centrepiece of The Love Movement, which was the last album the group released before an 18-year hiatus. While the album’s production was handled by the Ummah, “Find a Way” has the distinction of being the final A Tribe Called Quest single to feature production from the late J Dilla. Playfully drawing from Towa Tei’s “Technova (Folknova),” Tip and Phife lyrically explore the complexities of a romantic relationship, questioning if escalating the situation is truly worthwhile. While the acclaim of earlier albums may have skewed the reception of The Love Movement, this song remains an undeniable bop, and one hell of a beat by Dilla.\n\n\t5.\t“Oh My God” feat. Busta Rhymes\nMidnight Marauders (1993)\n\n“Oh My God” stands as one of the hardest-hitting tracks on Midnight Marauders. While it seamlessly integrates with the rest of the album, its Lee Morgan-sampled bassline, horns sourced from Kool & the Gang, and neck-snapping drums — courtesy of the Whatnauts’ “Why Can’t People Be Colors Too?” — make it especially distinctive. It’s a quintessential representation of prime ATCQ and resides among the best of East Coast golden-era hip-hop. Elevated by an energetic chorus repetition from Busta Rhymes, both Tip and Phife are on point, with Phife in particular delivering the line, “When’s the last time you heard a funky diabetic?” It’s haunting in hindsight. This track was featured in the controversial cult classic film Kids, during the Washington Park sequence.\n\n\t4.\t“Check the Rhime”",
    "clean_content": "“Find a Way” serves as the centrepiece of The Love Movement, which was the last album the group released before an 18-year hiatus. While the album’s production was handled by the Ummah, “Find a Way” has the distinction of being the final A Tribe Called Quest single to feature production from the late J Dilla. Playfully drawing from Towa Tei’s “Technova (Folknova),” Tip and Phife lyrically explore the complexities of a romantic relationship, questioning if escalating the situation is truly worthwhile. While the acclaim of earlier albums may have skewed the reception of The Love Movement, this song remains an undeniable bop, and one hell of a beat by Dilla.\n\n\t5.\t“Oh My God” feat. Busta Rhymes\nMidnight Marauders (1993)\n\n“Oh My God” stands as one of the hardest-hitting tracks on Midnight Marauders. While it seamlessly integrates with the rest of the album, its Lee Morgan-sampled bassline, horns sourced from Kool & the Gang, and neck-snapping drums — courtesy of the Whatnauts’ “Why Can’t People Be Colors Too?” — make it especially distinctive. It’s a quintessential representation of prime ATCQ and resides among the best of East Coast golden-era hip-hop. Elevated by an energetic chorus repetition from Busta Rhymes, both Tip and Phife are on point, with Phife in particular delivering the line, “When’s the last time you heard a funky diabetic?” It’s haunting in hindsight. This track was featured in the controversial cult classic film Kids, during the Washington Park sequence.\n\n\t4.\t“Check the Rhime”",
    "excerpt": "“Find a Way” serves as the centrepiece of The Love Movement, which was the last album the group released before an 18-year hiatus.",
    "source": "EXCLAIM"
  },
  {
    "post_name": "the-low-end-theory-1991",
    "date": "",
    "title": "The Low End Theory (1991)",
    "content": "This single was a coming-out party for Phife, setting the stage for how he came to be revered for the rest of his career. Coming out of the gate, ATCQ were highly acclaimed as a breath of fresh air, though the group’s pen work wasn’t always balanced. “Check the Rhime” was a shift: while the debut album worked overtime proving Tip’s lyrical prowess, their sophomore saw his partner steal the show. As the first single from The Low End Theory, “Check the Rhime” firmly established the duo’s god-tier chemistry, with Phife in particular packing in all his naysayers with a “funky introduction of how nice” he truly was on the mic.\n\n\t3.\t“Award Tour” feat. Trugoy the Dove\nMidnight Marauders (1993)\n\nForever the hip-hop scientist, Tip long studied how sound can affect crowds. As he tells it, upon seeing a club crowd react to the bassline of Jade’s hit single “Don’t Walk Away,” he knew he needed to sample it. Mixed in a metaphorical cauldron with Weldon Irvine’s “We Gettin’ Down,” among other things, the resulting single was “Award Tour,” featuring the late Trugoy the Dove on the chorus. The first single from Midnight Marauders, dropping a few weeks ahead of the LP, the song was the group’s highest-charting moment on the Billboard Hot 100, peaking at No. 47. It remains a high point.\n\n\t2.\t“Bonita Applebum”",
    "clean_content": "This single was a coming-out party for Phife, setting the stage for how he came to be revered for the rest of his career. Coming out of the gate, ATCQ were highly acclaimed as a breath of fresh air, though the group’s pen work wasn’t always balanced. “Check the Rhime” was a shift: while the debut album worked overtime proving Tip’s lyrical prowess, their sophomore saw his partner steal the show. As the first single from The Low End Theory, “Check the Rhime” firmly established the duo’s god-tier chemistry, with Phife in particular packing in all his naysayers with a “funky introduction of how nice” he truly was on the mic.\n\n\t3.\t“Award Tour” feat. Trugoy the Dove\nMidnight Marauders (1993)\n\nForever the hip-hop scientist, Tip long studied how sound can affect crowds. As he tells it, upon seeing a club crowd react to the bassline of Jade’s hit single “Don’t Walk Away,” he knew he needed to sample it. Mixed in a metaphorical cauldron with Weldon Irvine’s “We Gettin’ Down,” among other things, the resulting single was “Award Tour,” featuring the late Trugoy the Dove on the chorus. The first single from Midnight Marauders, dropping a few weeks ahead of the LP, the song was the group’s highest-charting moment on the Billboard Hot 100, peaking at No. 47. It remains a high point.\n\n\t2.\t“Bonita Applebum”",
    "excerpt": "This single was a coming-out party for Phife, setting the stage for how he came to be revered for the rest of his career.",
    "source": "EXCLAIM"
  },
  {
    "post_name": "peoples-instinctive-travels-and-the-paths-of-rhythm-1990",
    "date": "",
    "title": "People’s Instinctive Travels and the Paths of Rhythm (1990)",
    "content": "Flipping the Roy Ayers-produced “Daylight” — a chef’s kiss-worthy groove that appeared on RAMP’s only group project — Tip went solo for this enduring slice of bliss. One of his earliest songs, it was first demoed in 1985, when he was just 15 years old. After reading a Miles Davis interview, Tip learned to play with “space” and re-recorded the song for the group’s debut album. In its final form, the timeless track plays out as a playful one-sided conversation between Tip and a female love interest.\n\n\t1.\t“Electric Relaxation”\nMidnight Marauders (1993)\n\n“Electric Relaxation” is as close as the group got to creating a perfect song — a song that, 30 years later, continues to sound better with every listen. A clever flip of Ronnie Foster’s “Mystic Brew,” the track not only served as the theme song for the first two seasons of the WB hit sitcom The Wayans Bros., but it also contained possibly the most cleverly hyper-local reference ever, with Phife giving a playfully lewd nod to Long-Island chain Seaman’s Furniture.",
    "clean_content": "Flipping the Roy Ayers-produced “Daylight” — a chef’s kiss-worthy groove that appeared on RAMP’s only group project — Tip went solo for this enduring slice of bliss. One of his earliest songs, it was first demoed in 1985, when he was just 15 years old. After reading a Miles Davis interview, Tip learned to play with “space” and re-recorded the song for the group’s debut album. In its final form, the timeless track plays out as a playful one-sided conversation between Tip and a female love interest.\n\n\t1.\t“Electric Relaxation”\nMidnight Marauders (1993)\n\n“Electric Relaxation” is as close as the group got to creating a perfect song — a song that, 30 years later, continues to sound better with every listen. A clever flip of Ronnie Foster’s “Mystic Brew,” the track not only served as the theme song for the first two seasons of the WB hit sitcom The Wayans Bros., but it also contained possibly the most cleverly hyper-local reference ever, with Phife giving a playfully lewd nod to Long-Island chain Seaman’s Furniture.",
    "excerpt": "Flipping the Roy Ayers-produced “Daylight” — a chef’s kiss-worthy groove that appeared on RAMP’s only group project — Tip went solo for this enduring slice of bliss.",
    "source": "EXCLAIM"
  },
  {
    "post_name": "westside-gunns-curation-remains-impeccable-on-hitler-wears-hermes-8",
    "date": "",
    "title": "Westside Gunn’s Curation Remains Impeccable on ‘Hitler Wears Hermes 8’",
    "content": "One thing stays clear no matter what Westside Gunn touches: his curation skills are impeccable. Griselda’s multi-year run looks anything but winded with Sincerely Adolf, the eighth (and ambiguously final) installment of the series that started it all for the collective, Hitler Wears Hermes. The project is concise, with little wasted space among the 13 tracks.\n\nWhat becomes immediately apparent is the extra time that Gunn spent cooking up this platter. Notoriously known to record projects in a matter of days, the additional love has the Buffalo MC sounding spryer and sharper than ever. Whether rocking alongside Stove God Cooks — who sparkles on all four of his features — or teaming up with one of the more revered rappers of the past two decades, Lil Wayne — who bodies the screwface-inducing “Bash Money” — he’s never overpowered.\n\nThat’s one of the most admirable things about West’s executive production; guests are brought to his level, and you can hear the mutual respect. Everything feels organic rather than an attempt to shove square pegs into circle slots. This is accentuated by the production throughout, crafted by Conductor Williams, Denny LaFlare (who contributed some of the project’s most brilliant gems) and longtime collaborator Camoflauge Monk. The beats all feel cohesive, as if the three producers were one.\n\nAn Achilles heel of Griselda affairs can sometimes be when things get a little too off-kilter or when elements overstay their welcome. “Westheimer,” featuring Stove God Cooks, slow-flow Griselda rhymer Boldy James (fresh off of his Bo Jackson LP with the Alchemist) and Sauce Walka, is minimalist to the point of sonic monotony, especially with Boldy’s flow. Then there is Gunn’s long-winded speech about how much money he has on “Claires Back,” which makes an otherwise hype song — with an incredible second half thanks to Conway the Machine and Benny the Butcher — longer than it needs to be.\n\nBut it’s hard to stay mad at this project’s momentary lulls, as it’s yet another example of Gunn giving fans everything they want and expect. From classic Hall & Nash back-to-back bars with Conway (“Spoonz”), a platform for acts he champions like Rome Streetz (who appears on “Draymond” and “Peri Peri”), and one or two features with cultural icons (in this case, Jadakiss and Lil Wayne), the formula stays remarkably similar but — as it always does with Gunn at the helm — feels exceptionally fresh.\n\nAccording to Gunn, this is one side of a two-part set. It remains to be seen if that second act will have a similar vibe sonically, especially considering Griselda acts Armani Caesar and YN Billy are noticeably absent this time around — as is a Keisha Plum poem, which is generally a WSG staple. For that matter, it’s difficult to know if this is indeed the final installment, as that was a descriptor given to the seventh entry in the series.\n\nIt feels like as long as West is engaged and feeling creative, we’re in for more music, and if he keeps giving us consistency on this level, it’s hard to be mad at that.",
    "clean_content": "One thing stays clear no matter what Westside Gunn touches: his curation skills are impeccable. Griselda’s multi-year run looks anything but winded with Sincerely Adolf, the eighth (and ambiguously final) installment of the series that started it all for the collective, Hitler Wears Hermes. The project is concise, with little wasted space among the 13 tracks.\n\nWhat becomes immediately apparent is the extra time that Gunn spent cooking up this platter. Notoriously known to record projects in a matter of days, the additional love has the Buffalo MC sounding spryer and sharper than ever. Whether rocking alongside Stove God Cooks — who sparkles on all four of his features — or teaming up with one of the more revered rappers of the past two decades, Lil Wayne — who bodies the screwface-inducing “Bash Money” — he’s never overpowered.\n\nThat’s one of the most admirable things about West’s executive production; guests are brought to his level, and you can hear the mutual respect. Everything feels organic rather than an attempt to shove square pegs into circle slots. This is accentuated by the production throughout, crafted by Conductor Williams, Denny LaFlare (who contributed some of the project’s most brilliant gems) and longtime collaborator Camoflauge Monk. The beats all feel cohesive, as if the three producers were one.\n\nAn Achilles heel of Griselda affairs can sometimes be when things get a little too off-kilter or when elements overstay their welcome. “Westheimer,” featuring Stove God Cooks, slow-flow Griselda rhymer Boldy James (fresh off of his Bo Jackson LP with the Alchemist) and Sauce Walka, is minimalist to the point of sonic monotony, especially with Boldy’s flow. Then there is Gunn’s long-winded speech about how much money he has on “Claires Back,” which makes an otherwise hype song — with an incredible second half thanks to Conway the Machine and Benny the Butcher — longer than it needs to be.\n\nBut it’s hard to stay mad at this project’s momentary lulls, as it’s yet another example of Gunn giving fans everything they want and expect. From classic Hall & Nash back-to-back bars with Conway (“Spoonz”), a platform for acts he champions like Rome Streetz (who appears on “Draymond” and “Peri Peri”), and one or two features with cultural icons (in this case, Jadakiss and Lil Wayne), the formula stays remarkably similar but — as it always does with Gunn at the helm — feels exceptionally fresh.\n\nAccording to Gunn, this is one side of a two-part set. It remains to be seen if that second act will have a similar vibe sonically, especially considering Griselda acts Armani Caesar and YN Billy are noticeably absent this time around — as is a Keisha Plum poem, which is generally a WSG staple. For that matter, it’s difficult to know if this is indeed the final installment, as that was a descriptor given to the seventh entry in the series.\n\nIt feels like as long as West is engaged and feeling creative, we’re in for more music, and if he keeps giving us consistency on this level, it’s hard to be mad at that.",
    "excerpt": "One thing stays clear no matter what Westside Gunn touches: his curation skills are impeccable.",
    "source": "EXCLAIM"
  },
  {
    "post_name": "grown-raekwon-drops-classic-in-my-eyes-solo-album-the-wild",
    "date": "",
    "title": "“Grown” Raekwon Drops “Classic, In My Eyes” Solo Album ‘The Wild’",
    "content": "This August marks 22 years since Wu-Tang Clan stalwart Raekwon dropped his groundbreaking debut Only Built 4 Cuban Linx. Now Rae is unleashing his seventh solo album, The Wild, on IceH20/Empire. “I was trying to give [fans] a grown Raekwon album,” he tells Exclaim, “a record that people can say is well rounded and full of moments.”\n\nIn contrast to 2015’s Fly International Luxurious Art, on which Rae flew solo on only three of the 13 songs, features on The Wild are subdued and methodical. “I wanted to come from a different perspective; [Lil] Wayne, I never worked with Wayne before, and I felt like that would be interesting. I never collaborated with CeeLo Green before, so I felt like that would be interesting.” Also on the project is new school hero G-Eazy, an artist Rae admits he’s been into for a while. “I respect what he’s doing, and he’s an artist I feel he deserves that platform to be recognized as one of the great MCs in the game.”\nThe LP also serves as an introduction to his new artist, P.U.R.E. “I think he might be the first kid that I know that comes out the door from this new generation that’s going to make a classic album. I’m excited about that.”\n\nThe project as a whole explores a more insightful tone than his past releases. “I wanted fans to say, ‘Look, Rae ain’t just on some gunman shit, he’s talking about surviving and stuff too,’” he says with a laugh. “I feel like, as an artist, growth is so important.” He acknowledges that his age and his family have helped shape his evolved maturity level as an artist. “We get older and have children; you want the best for your kids. You want them to know that it ain’t about being negative all the time in the music.”\n\nWith a documentary set to drop this year, releases on his label, and The Wild all helping to bolster his personal brand further, he’s quick to clarify any perceived animosity between himself and the Wu-Tang Clan. “It’s never an issue with my brothers. They doing their thing; we already in discussions talking about moving forward together.”\n\nIt has always been about the sum, though, as Raekwon explains: “I think I was always designed to make albums, and not just sit on singles.” Ultimately, he feels that The Wild is one of his most complete projects to date, and his excitement about it is infectious. “I just wanted to give you guys a collage of great thoughts from a great person. I’m feeling great; the fans keep me motivated.”\n\nHow does it stack up to OB4CL? “It’s a classic in my eyes,” he says confidently. “It’s me giving y’all the best that I can give you.”",
    "clean_content": "This August marks 22 years since Wu-Tang Clan stalwart Raekwon dropped his groundbreaking debut Only Built 4 Cuban Linx. Now Rae is unleashing his seventh solo album, The Wild, on IceH20/Empire. “I was trying to give [fans] a grown Raekwon album,” he tells Exclaim, “a record that people can say is well rounded and full of moments.”\n\nIn contrast to 2015’s Fly International Luxurious Art, on which Rae flew solo on only three of the 13 songs, features on The Wild are subdued and methodical. “I wanted to come from a different perspective; [Lil] Wayne, I never worked with Wayne before, and I felt like that would be interesting. I never collaborated with CeeLo Green before, so I felt like that would be interesting.” Also on the project is new school hero G-Eazy, an artist Rae admits he’s been into for a while. “I respect what he’s doing, and he’s an artist I feel he deserves that platform to be recognized as one of the great MCs in the game.”\nThe LP also serves as an introduction to his new artist, P.U.R.E. “I think he might be the first kid that I know that comes out the door from this new generation that’s going to make a classic album. I’m excited about that.”\n\nThe project as a whole explores a more insightful tone than his past releases. “I wanted fans to say, ‘Look, Rae ain’t just on some gunman shit, he’s talking about surviving and stuff too,’” he says with a laugh. “I feel like, as an artist, growth is so important.” He acknowledges that his age and his family have helped shape his evolved maturity level as an artist. “We get older and have children; you want the best for your kids. You want them to know that it ain’t about being negative all the time in the music.”\n\nWith a documentary set to drop this year, releases on his label, and The Wild all helping to bolster his personal brand further, he’s quick to clarify any perceived animosity between himself and the Wu-Tang Clan. “It’s never an issue with my brothers. They doing their thing; we already in discussions talking about moving forward together.”\n\nIt has always been about the sum, though, as Raekwon explains: “I think I was always designed to make albums, and not just sit on singles.” Ultimately, he feels that The Wild is one of his most complete projects to date, and his excitement about it is infectious. “I just wanted to give you guys a collage of great thoughts from a great person. I’m feeling great; the fans keep me motivated.”\n\nHow does it stack up to OB4CL? “It’s a classic in my eyes,” he says confidently. “It’s me giving y’all the best that I can give you.”",
    "excerpt": "This August marks 22 years since Wu-Tang Clan stalwart Raekwon dropped his groundbreaking debut Only Built 4 Cuban Linx. Now Rae is unleashing his seventh solo album, The Wild, on IceH20/Empire.",
    "source": "EXCLAIM"
  }
]